Revit 2027 API
FabricationPart.ProductCode Property
 The current database id of the part within the fabrication database.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductCode { get; }
Public ReadOnly Property ProductCode As String
	Get
public:
property String^ ProductCode {
	String^ get ();
}
member ProductCode : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace